#ประมาณค่าของPI
# Area of circle = Pi*(r)^2
#Area of squire = (2r)^2 ซึ่งวงกลมแนบอยู่ใน 4 เหลี่ยม
# กำหนดให้ r = 1 จะได้ Pi = 4*(Area of circle/Area of squire)
#สุ่มจุดมา เพื่อหาสัดส่วนเพื่อประมาณค่า Pi ยิ่งสุ่มมากยิ่งจะเข้าใกล้ Pi จริงๆ

n <- 0 #นับจุดที่อยู่ในวงกลมซึ่งอยู่ด้านในสี่เหลียมด้วย
N <- 10000 #จำนวนจุดทั้งหมดที่ต้องการใช้ประมาณค่า ปล.สร้างไว้เพื่อรับ user input ในอนาคต
R_pow_2 <- numeric(0) # สร้าง vector ว่าง เพื่อเก็บค่า R^2

x <-runif(N, min=-1, max=1) # random พิกัดแกน x มาตาม N
y <-runif(N, min=-1, max=1) # random พิกัดแกน y มาตาม N 
 
#ลูป เก็บค่า (x^2 + y^2) แต่ละชุด เพื่อเช็คว่าเป็นจุดในวงกลมหรือไม่ต่อไป
for(i in 1:length(x)){
  R_pow_2[i] <- x[i]*x[i]+y[i]*y[i]
}

#ลูปเพื่อหา พิกัด x,y ใด เป็นจุดในวงกลม
for(i in 1:length(R_pow_2)){
  if(R_pow_2[i] <= 1){ #เช็คจุดว่าอยู่ในเงื่อนไขของวงกลมหรือไม่
    n <- n+1 # ถ้าเป็นพิกัดในวงกลมก็จะนับพิกัดนั้น
    }
}

#ทดสอบประมาณค่า
pi <- (n/N)*4 #ค่า pi ที่ประมาณได้ 
print(pi)

