#สร้างเวกเตอร์สำหรับเก็บค่าz
positive_z<-c()

#วนลูปเพื่อเก็บค่าz
for(i in seq(0.0,3.5,0.01)){
  
  #เก็บค่า z จาก pnorm
  positive_z<-c(positive_z,pnorm(i))
  
  #แปลงข้อมูลในเวกเตอร์ให้เป็นทศนิยม5ตำแหน่ง
  x = formatC(positive_z, digits = 5, format = "f")
}

#สร้างเมทริกซ์A เพื่อเก็บค่า z ที่แปลงทศนิยมแล้ว
A<-matrix(x,nrow=35,ncol=10,byrow = TRUE)

#แสดงเมทริกซ์A
A

#สร้างเวกเตอร์สำหรับเก็บค่า z ที่เป็นลบ
negative_z<-c()

#เนื่องจากตารางz negative ไล่จาก -3.4 ถึง 0.0 จากบนลงล่าง จึงสร้างลูปเพื่อเก็บค่า z ตามรูปแบบตารางจริง

#ลูปนอกใช้วนzที่ทศนิยม1ตำแหน่ง ตั้งแต่ -3.4 ถึง 0.0
for(i in seq(-3.4,-0.0,0.1)){
  
  #ลูปในใช้ไล่ทศนิยมตำแหน่งที่ 2 ตั้งแต่ 0.09 ถึง 0.01  
  for(j in seq(i,i-0.09,-0.01)){
    
    #เก็บค่า z จาก pnorm
    negative_z<-c(negative_z,pnorm(j))
    
    #แปลงข้อมูลในเวกเตอร์ให้เป็นทศนิยม5ตำแหน่ง
    x = formatC(negative_z, digits=5, format ="f")
  }
}

#สร้างเมทริกซ์B เพื่อเก็บค่า z ที่แปลงทศนิยมแล้ว
B<-matrix(x,nrow=35,ncol=10,byrow=TRUE)

#แสดงเมทริกซ์B
B
