#การประมาณค่า PI 
#นาย เมธานนท์ แก้วกระจ่าง 62050214 
# Area of circle = Pi*(r)^2
#Area of squire = (2r)^2 ซึ่งวงกลมนี้แนบอยู่ใน 4 เหลี่ยม
# กำหนดให้ r = 1 จะได้ Pi = 4*(Area of circle/Area of squire)
#สุ่มจุดมา เพื่อหาสัดส่วนเพื่อประมาณค่า Pi ยิ่งสุ่มมากยิ่งจะเข้าใกล้ Pi จริงๆ

n <- 0 #นับจุดที่อยู่ในวงกลมและ สี่เหลี่ยม
N <- 10000 #นับจุดทั้งหมดที่อยู่ในสี่เหลี่ยม
R_pow_2 <- numeric(0) # สร้าง vector ว่าง เพื่อเก็บค่า R^2
x <-runif(10000, min=-1, max=1) # random พิกัดแกน  x มา10000ค่า
y <-runif(10000, min=-1, max=1) # random พิกัดแกน y มา10000ค่า

#ลูป เก็บค่า x^2 + y^2 
for(i in 1:length(x)){
  R_pow_2[i] <- x[i]*x[i]+y[i]*y[i]
}

#ลูปเพื่อหา พิกัด x,y ใด เป็นจุดในวงกลม
for(i in 1:length(R_pow_2)){
  if(R_pow_2[i] <= 1){
    n <- n+1 # นับพิกัดในวงกลม
  }
}

pi <- (n/N)*4 #ค่า pi ที่ประมาณได้ 
cat("ค่าPIที่ประมาณได้คือ")
print(pi)

